document.getElementById("wr1").onclick = function qara(){
    let qr = document.getElementById("tt");
    qr.innerHTML = "Бұл жасқа келгенше жақсы өткіздік пе, жаман өткіздік пе, әйтеуір бірталай өмірімізді өткіздік: алыстық, жұлыстық, айтыстық, тартыстық - әурешілікті көре-көре келдік. Енді жер ортасы жасқа келдік: қажыдық, жалықтық; қылып жүрген ісіміздің баянсызын, байлаусызын көрдік, бәрі қоршылық екенін білдік. Ал, енді қалған өмірімізді қайтіп, не қылып өткіземіз? Соны таба алмай өзім де қайранмын.Ел бағу? Жоқ, елге бағым жоқ. Бағусыз дертке ұшырайын деген кісі бақпаса, не албыртқан, көңілі басылмаған жастар бағамын демесе, бізді құдай сақтасын!Мал бағу? Жоқ, баға алмаймын. Балалар өздеріне керегінше өздері бағар. Енді қартайғанда қызығын өзің түгел көре алмайтұғын, ұры, залым, тілемсектердің азығын бағып беремін деп, қалған аз ғана өмірімді қор қылар жайым жоқ.Ғылым бағу? Жоқ, ғылым бағарға да ғылым сөзін сөйлесер адам жоқ. Білгеніңді кімге үйретерсің, білмегеніңді кімнен сұрарсың? Елсіз-күнсізде кездемені жайып салып, қолына кезін алып отырғанның не пайдасы бар? Мұңдасып шер тарқатысар кісі болмаған соң, ғылым өзі - бір тез қартайтатұғын күйік.Софылық қылып, дін бағу? Жоқ, ол да болмайды, оған да тыныштық керек. Не көңілде, не көрген күніңде бір тыныштық жоқ, осы елге, осы жерде не қылған софылық?Балаларды бағу? Жоқ, баға алмаймын. Бағар едім, қалайша бағудың мәнісін де білмеймін, не болсын деп бағам, қай елге қосайын, қай харекетке қосайын? Балаларымның өзіне ілгері өмірінің, білімінің пайдасын тыныштықпенен керерлік орын тапқаным жоқ, қайда бар, не қыл дерімді біле алмай отырмын, не бол деп бағам? Оны да ермек қыла алмадым.Ақыры ойладым: осы ойыма келген нәрселерді қағазға жаза берейін, ақ қағаз бен қара сияны ермек қылайын, кімде-кім ішінен керекті сөз тапса, жазып алсын, я оқысын, керегі жоқ десе, өз сөзім өзімдікі дедім де, ақыры осыған байладым, енді мұнан басқа ешбір жұмысым жоқ.";
    let h2 = document.getElementById("hh");
    h2.innerHTML = "Абайдың Бірінші қара сөзі"
}
document.getElementById("wr2").onclick = function qara2(){
    let qr = document.getElementById("tt");
    qr.innerHTML = "Мен бала күнімде естуші едім, біздің қазақ сартты көрсе, күлуші еді «енеңді ұрайын, кең қолтық, шүлдіреген тәжік, Арқадан үй төбесіне саламын деп, қамыс артқан, бұтадан қорыққан, көз көргенде «әке-үке» десіп, шығып кетсе, қызын боқтасқан, «сарт-сұрт деген осы» деп. Ноғайды көрсе, оны да боқтап күлуші еді: «түйеден қорыққан ноғай, атқа мінсе - шаршап, жаяу жүрсе - демін алады, ноғай дегенше, ноқай десеңші, түкке ыңғайы келмейді, солдат ноғай, қашқын ноғай, башалшік ноғай» деп. Орысқа да күлуші еді: «ауылды көрсе шапқан, жаман сасыр бас орыс» деп.Орыс ойына келгенін қылады деген... не айтса соған нанады, «ұзын құлақты тауып бер депті» деп.Сонда мен ойлаушы едім: ей, құдай-ай, бізден басқа халықтың бәрі антұрған, жаман келеді екен, ең тәуір халық біз екенбіз деп, әлгі айтылмыш сөздерді бір үлкен қызық көріп, қуанып күлуші едім.Енді қарап тұрсам, сарттың екпеген егіні жоқ, шығармаған жемісі жоқ, саудагерінің жүрмеген жері жоқ, қылмаған шеберлігі жоқ. Өзіменен өзі әуре болып, біріменен бірі ешбір шаһары жауласпайды! Орысқа қарамай тұрғанда қазақтың өлісінің ахиреттігін, тірісінің киімін сол жеткізіп тұрды. Әке балаға қимайтұғын малыңды кірелеп сол айдап кетіп тұрды ғой. Орысқа қараған соң да, орыстың өнерлерін бізден олар көп үйреніп кетті. Үлкен байлар да, үлкен молдалар да, ептілік, қырмызылық, сыпайылық - бәрі соларда. Ноғайға қарасам, солдаттыққа да шыдайды, кедейлікке де шыдайды, қазаға да шыдайды, молда, медресе сақтап, дін күтуге де шыдайды. Еңбек қылып, мал табудың да жөнін солар біледі, салтанат, әсем де соларда. Оның малдыларына, құзғын тамағымыз үшін, біріміз жалшы, біріміз қош алушымыз. Біздің ең байымызды: «сәнің шақшы аяғың білән пышыратырға қойған идән түгіл, шық, сасық казақ», - деп үйінен қуып шығарады. Оның бәрі - бірін-бірі қуып қор болмай, шаруа қуып, өнер тауып, мал тауып, зор болғандық әсері. Орысқа айтар сөз де жоқ, біз құлы, күңі құрлы да жоқпыз. Бағанағы мақтан, бағанағы қуанған, күлген сөздеріміз қайда?";
    let h2 = document.getElementById("hh");
    h2.innerHTML = "Абайдың Екінші қара сөзі"
}
document.getElementById("wr3").onclick = function qara2(){
    let qr = document.getElementById("tt");
    qr.innerHTML =" Қазақтың бірінің біріне қаскүнем болмағының, бірінің тілеуін бірі тілеспейтұғынының, рас сөзі аз болатұғынының, қызметке таласқыш болатұғынының, өздерінің жалқау болатұғынының себебі не? Һәмма ғаламға белгілі данышпандар әлдеқашан байқаған: әрбір жалқау кісі қорқақ, қайратсыз тартады; әрбір қайратсыз қорқақ, мақтаншақ келеді; әрбір мақтаншақ қорқақ, ақылсыз, надан келеді; әрбір ақылсыз надан, арсыз келеді; әрбір арсыз жалқаудан сұрамсақ, өзі тойымсыз, өнерсіз, ешкімге достығы жоқ жандар шығады.Мұның бәрі төрт аяқты малды көбейтеміннен басқа ойының жоқтығынан, өзге егін, сауда, өнер, ғылым - солар секілді нәрселерге салынса, бұлай болмас еді. Әрбір мал іздеген малым көп болса, өзімдікі де, балаларым да малды болса екен дейді. Ол мал көбейсе, малшыларға бақтырмақ, өздері етке, қымызға тойып, сұлуды жайлап, жүйрікті байлап отырмақ. Қыстауы тарлық қылса, арызы жеткендік, сыйы өткендік, байлық қызметінен біреудің қыстауын сатып алмақ, ептеп алмақ, тартып алмақ. Ол қыстауынан айырылған және біреуге тиіспек, я болмаса орынсыздығынан елден кетпек - әр қазақтың ойы осы.Осылар біріне бірі достық ойлай ала ма? Кедей көп болса, ақысы кем болар еді, малдан айырылғандар көбейсе, қыстауы босар еді деп, мен ананы кедей болса екен деп, ол мені кедей болса екен деп, әуелде ішімізбен қас сағындық. Әрі-беріден соң сыртымызға шықты, жауластық, дауластық, партияластық. Осындай қастарға сөзім өтімді болсын және де ептеп мал жиюға күшім жетімді болсын деп, қызметке болыстық, билікке таластық.Сонан соң не момынның баласы бөтен жаққа шығып, еңбек қылып, мал іздемейді, егін, сауданың керегі жоқ болады. Өз басын өзі осындай таласпенен кісі көбейтеміз деп партия жиғандардың бүгін біреуіне, ертең біреуіне кезекпен сатады да жүреді. Ұрылар тыйылмайды. Ел тыныш болса, оның ұрлығын ешкім сүйемес еді. Ел екі жар болған соң, кім ант ішіп ақтап, арамдығын жақтап, сүйеймін десе, соған жақ болып сүйеніп, бұрынғыдан ұрлығын әлденеше есе асырады.Елдегі жақсы адамдардың бәрінің үстінен бекер, өтірік «шапты, талады» деген әртүрлі уголовный іс көрсетіп, арыз береді. Оған дознание - тергеу шығарады. Өтірік көрмегенін көрдім деуші куәлар да әлдеқашан дайындап қойылған, бағанағы жақсы адам сайлауға жарамасы үшін. Ол адам басын құтқармақ үшін жамандарға жалынса, оның да адамдығының кеткені, егер жалынбаса, тергеулі, сотты адам болып, ешбір қызметке жарамай, басы қатерге түсіп өткені. Ол болыс болғандар өзі қулық, арамдықпенен болыстыққа жеткен соң, момынды қадірлемейді, өзіндей арам, қуларды қадірлейді, өзіме дос болып, жәрдемі тиеді деп, егер қас болса, бір түрлі өзіме де залал жасауға қолынан келеді деп.Осы күнде қазақ ішінде «ісі білмес, кісі білер» деген мақал шықты. Оның мәнісі: «ісіңнің түзулігінен жетпессің, кісіңнің амалшы, айлалылығынан жетерсің» деген сөз. Үш жылға болыс сайланады. Әуелгі жылы «Сені біз сайламадық па?» деп елдің бұлданғандығымен күні өтеді. Екінші жылы кандидатпенен аңдысып күні өтеді. Үшінші жылы сайлауға жақындап қалып, тағы болыс болып қалуға болар ма екен деп күні өтеді. Енді несі қалды? Осы қазақ халқының осындай бұзықшылыққа тартып, жылдан жылға төмендеп бара жатқанын көрген соң, менің ойыма келеді: Халықтың болыстыққа сайлаймын деген кісісі пәлен қадәрлі орысша образование алған кісі болсын. Егер де орталарында ондай кісісі жоқ болса, яки бар болса да сайламаса, уезный начальник пенен военный губернатордың назначениесімен болады десе, бұл халыққа бек пайдалы болар еді. Оның себебі: әуелі - қызметқұмар қазақ балаларына образование беруге ол да - пайдалы іс, екінші - назначениемен болған болыстар халыққа міндетті болмас еді, ұлықтарға міндетті болар еді."
     let h2 = document.getElementById("hh");
    h2.innerHTML = "Абайдың Үшінші қара сөзі"
}
document.getElementById("wr4").onclick = function qara2(){
    let qr = document.getElementById("tt");
    qr.innerHTML ="Әрбір байқаған адам білсе керек: күлкі өзі бір мастық екенін, әрбір мас кісіден ғафил көп өтетұғынын да, әрбір мастың сөйлеген кезінде бас ауыртатұғынын. Бұлай болғанда, күлкіге салынған кісі не шаруадан, не ақылдан, не бір ұят келерлік істен құр, ғафил көп өткізіп отырса керек. Осындай ғафилдік көп өткізіп, өлмеген кісінің не дүниеде, не ахиретте басы бір ауырмай қалмаса керек.Әрбір уайым-қайғы ойлағыш кісі не дүние шаруасына, не ахирет шаруасына өзгеден жинақырақ болса керек. Әрбір жинақылықтың түбі кәніш болса керек. Енді олай болғанда, үнемі уайым-қайғыменен жүре аламыз ба? Үнемі күлмей жүруге жан шыдай ма екен? Жоқ, мен үнемі уайым-қайғыменен бол демеймін. Уайым-қайғысыздығыңа уайым-қайғы қыл дағы, сол уайым-қайғысыздықтан құтыларлық орынды харекет табу керек һәм қылу керек. Әрбір орынды харекет өзі де уайым-қайғыны азайтады, орынсыз күлкіменен азайтпа, орынды харекетпен азайт!Шығар есігін таба алмай, уайым-қайғының ішіне кіріп алып, қамалып қалмақ, ол өзі де - бір антұрғандық. Және әрбір жаман кісінің қылығына күлсең, оған рахаттанып күлме, ыза болғаныңнан күл, ызалы күлкі - өзі де қайғы. Ондай күлкіге үнемі өзің де салынбассың, әрбір жақсы адамның жақсылық тапқанына рахаттанып күлсең, оның жақсылықты жақсылығынан тапқандығын ғибрат көріп күл. Әрбір ғибрат алмақтың өзі де мастыққа жібермей, уақытымен тоқтатады. Көп күлкінің бәрін де мақтағаным жоқ, оның ішінде бір күлкі бар-ау, құдай жаратқан орныменен іштен, көкіректен, жүректен келмейді, қолдан жасап, сыртыменен бет-аузын түзеп, бай-бай күлкінің әнін сәндеп, әдемішілік үшін күлетін бояма күлкі."
  let h2 = document.getElementById("hh");
    h2.innerHTML = "Абайдың Төртінші қара сөзі"
}
document.getElementById("wr5").onclick = function qara2(){
    let qr = document.getElementById("tt");
    qr.innerHTML =" Көкірек толған қайғы кісінің өзіне де билетпейді, бойды шымырлатып, буынды құртып, я көзден жас болып ағады, я тілден сөз болып ағады. Қазақтар: «Ә, құдай, жас баладай қайғысыз қыла гөр!» деп тілек тілегенін өзім көрдім. Онысы - жас баладан гөрі өзі есті кісі болып, ескермес нәрсесі жоқсып, қайғылы кісі болғансығаны. Қайғысы не десең, мақалдарынан танырсың: әуелі - «Түстік өмірің болса, күндік мал жи», «Өзіңде жоқ болса, әкең де жат», «Мал - адамның бауыр еті», «Малдының беті - жарық, малсыздың беті - шарық», «Ер азығы мен бөрі азығы жолда», «Ердің малы елде, еріккенде қолда», «Берген перде бұзар», «Алаған қолым - береген», «Мал тапқан ердің жазығы жоқ», «Байдан үмітсіз - құдайдан үмітсіз», «Қарның ашса, қаралы үйге шап», «Қайраны жоқ көлден без, қайыры жоқ елден без» деген осындай сөздері көп, есепсіз толып жатыр.Бұл мақалдардан не шықты? Мағлұм болды: қазақ тыныштық үшін, ғылым үшін, білім үшін, әділет үшін қам жемейді екен, мал үшін қам жейді екен, бірақ ол малды қалайша табуды білмейді екен, бар білгені малдыларды алдап алмақ яки мақтап алмақ екен, бермесе оныменен жауласпақ екен. Малды болса, әкесін жаулауды да ұят көрмейді екен. Әйтеуір ұрлық, қулық-сұмдық, тіленшілік, соған ұқсаған қылықтың қайсысын болса да қылып жүріп, мал тапса, жазалы демесек керек екен.Бұлардың жас баланың ақылынан несі артық? Бірақ, жас бала қызыл ошақтан қорқушы еді, бұлар тозақтан да қорықпайды екен. Жас бала ұялса, жерге ене жаздаушы еді, бұлар неден болса да ұялмайды екен. Сол ма артылғаны? Қолымыздағыны үлестіріп талатпасақ, біз де өзіндей болмасақ, безеді екен. Іздеген еліміз сол ма?"
let h2 = document.getElementById("hh");
    h2.innerHTML = "Абайдың Бесінші қара сөзі"
}
document.getElementById("wr6").onclick = function qara2(){
    let qr = document.getElementById("tt");
    qr.innerHTML ="Қазақтың бір мақалы: «Өнер алды - бірлік, ырыс алды -тірлік» дейді. Бірлік қандай елде болады, қайтсе тату болады - білмейді. Қазақ ойлайды: бірлік - ат ортақ, ас ортақ, киім ортақ, дәулет ортақ болса екен дейді. Олай болғанда байлықтан не пайда, кедейліктен не залал? Ағайын құрымай мал іздеп не керек? Жоқ, бірлік - ақылға бірлік, малға бірлік емес. Малыңды беріп отырсаң, атасы басқа, діні басқа, күні басқалар да жалданып бірлік қылады! Бірлік малға сатылса, антұрғандықтың басы осы. Ағайын алмай бірлік қылса керек, сонда әркім несібесін құдайдан тілейді, әйтпесе құдайдан тілемейді, шаруа іздемейді. Әуелі біріне-бірі пәле іздейді. Не түсін, не ажарын, не өкпесін бұлдап, ол болмаса, бір пәле салып, қорғалатып, әйтеуір бірін-бірі алдаудың амалын іздеседі. Мұның қай жерінен бірлік шықты?«Ырыс алды - тірлік» дейді, ол қай тірлік? Ол осы жан кеудеден шықпағандық па? Жоқ, ондай тірлік итте де бар. Ондай тірлікті қымбат көріп, бұлдаған адам өлімді жау көріп, ахиретке дұшпан болады. Жанын қорғалатып, жаудан қашып, қорқақ атанып, еңбек қылудан, қызмет қылудан қашып, еріншек атанып, ез атанып, дүниеде әлгі айтылған ырысқа дұшпан болады. Ол айтқан тірлік олар емес. Көкірегі, көңілі тірі болса, соны айтады. Өзің тірі болсаң да, көкірегің өлі болса, ақыл табуға сөз ұға алмайсың. Адал еңбекпен ерінбей жүріп мал табуға жігер қыла алмайсың.Кеселді жалқау, қылжақбас,Әзір тамақ, әзір ас,Сыртың - пысық, ішің - нас,Артын ойлап ұялмас, -болып жүріп, тірімін деме, онан да алла жіберген ақ бұйрықты өлімнің өзі артық."
    let h2 = document.getElementById("hh");
    h2.innerHTML = "Абайдың Алтыншы қара сөзі"}

let count = 1;
let d1 = document.getElementById("sl1")
let d2 = document.getElementById("sl2")
document.getElementById("ha").onclick = function co(){
  count++;
  updiv()
}
document.getElementById("ah").onclick = function co(){
  count--;
  updiv()
}
function updiv(){
if (count %2 == 0) {
    d1.style.display = "none";
    d2.style.display = "block";
  } else {
    d1.style.display = "block";
    d2.style.display = "none";
  }
}

// let index = 0;
// const slides = document.querySelectorAll(".slide");

// function showSlide(i) {
//   slides.forEach((slide, n) => {
//     slide.style.display = n === i ? "block" : "none";
//   });
// }

// function nextSlide() {
//   index = (index + 1) % slides.length;
//   showSlide(index);
// }

// function prevSlide() {
//   index = (index - 1 + slides.length) % slides.length;
//   showSlide(index);
// }

// showSlide(index);
